node-artillery/fanca-api-login.yml
config:
# This is a test server run by team Artillery
# It's designed to be highly scalable
#  target: http://192.168.0.69:8080
#  target: http://192.168.0.71:8080
  target: https://api.fanca.io
#  target: https://dev-api.fanca.io
#  target: https://stg-api.fanca.io
  phases:
#    - duration: 2
#      arrivalRate: 1
#      rampTo: 5
#      name: Warm up phase
#    - duration: 60
#      arrivalRate: 5
#      rampTo: 10
#      name: Ramp up load
    - duration: 10
      arrivalRate: 10
      rampTo: 30
      name: Spike phase
# Load & configure a couple of useful plugins
# https://docs.art/reference/extensions
  plugins:
    ensure: { }
    apdex: { }
    metrics-by-endpoint: { }
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.response_time.p99: 100
      - http.response_time.p95: 75
scenarios:
  - flow:
      - loop:
          - post:
              url: "/mail/in"
              headers:
                build-mode: "contentsmadang-test"
              json:
                keyMail: "test@gmail.com"
                typeDevice: 1
                enc: "RSA"
                ver: 1
        count: 100